# https://github.com/Homebrew/homebrew-bundle

tap "olets/tap"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"

# Homebrew
# https://github.com/Homebrew/brew/

# brew "advancecomp"              # not needed — compression optimizer
brew "openssl@3"
brew "libyaml"
brew "readline"
# brew "ansible"                  # disabled — not using for AI infra
# brew "asciidoctor"              # not needed — AsciiDoc converter
brew "asdf"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
# brew "bats-core"                # disabled — bash test framework
brew "btop"
# brew "cloc"                     # disabled — line counter
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
# brew "docutils"                 # disabled — Python reST utilities
# brew "dos2unix"                 # disabled — line ending converter
brew "eza"
brew "fd"
# brew "ffmpegthumbnailer"        # not needed — video thumbnails
brew "gcc"
# brew "fastfetch"                # disabled — system info display
brew "fish"
# brew "flyctl"                   # not needed — Fly.io deployment CLI
# brew "fontforge"                # not needed — font editor
# brew "fonttools"                # not needed — font manipulation
brew "fzf"
brew "gh"
# brew "ghostscript"              # disabled — PostScript/PDF interpreter
# brew "gifsicle"                 # not needed — GIF manipulation
brew "git"
# brew "git-quick-stats"          # disabled — git statistics
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "hadolint"
brew "pkgconf"
# brew "highlight"                # disabled — source code highlighter
brew "htop"
# brew "httpie"                   # disabled — redundant with curl
# brew "hugo"                     # not needed — static site generator
# brew "imagemagick"              # disabled — image manipulation
# brew "jhead"                    # not needed — JPEG header editing
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "less"
# brew "libpq"                    # disabled — PostgreSQL client lib
# brew "libtermkey"               # disabled — terminal key library
# brew "lynx"                     # not needed — text web browser
# brew "markdownlint-cli2"        # disabled — markdown linter
# brew "mas"                      # disabled — MAS entries all disabled
# brew "media-info"               # disabled — media file metadata
# brew "memcached"                # disabled — in-memory cache
# brew "most"                     # disabled — redundant with bat/less
brew "neovim"
# brew "node"                     # not needed — managed by asdf
# brew "onefetch"                 # disabled — git repo summary
# brew "ossp-uuid"                # disabled — UUID library
brew "tmux"
# brew "overmind"                 # not needed — Procfile manager (Rails)
# brew "pandoc"                   # disabled — document converter
# brew "perl"                     # disabled — rarely used directly
# brew "pgcli"                    # disabled — PostgreSQL CLI
# brew "php"                      # not needed — web scripting language
# brew "pillow"                   # disabled — use pip/uv in venvs
# brew "pinentry-mac"             # disabled — GPG PIN entry
# brew "poppler"                  # disabled — PDF rendering library
# brew "postgresql@17", restart_service: :changed  # disabled — local DB
# brew "prettier"                 # not needed — JS/web formatter
# brew "pstree"                   # disabled — process tree
# brew "redis"                    # disabled — local Redis
brew "ripgrep"
# brew "rlwrap"                   # disabled — readline wrapper
brew "rsync"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "tealdeer"
# brew "telnet"                   # disabled — largely obsolete
brew "the_silver_searcher"
brew "trash"
brew "tree"
# brew "unar"                     # disabled — archive extractor
brew "universal-ctags"
# brew "urlview"                  # disabled — URL extractor
# brew "vips"                     # disabled — image processing
# brew "w3m"                      # not needed — text web browser
brew "wget"
# brew "wordnet"                  # not needed — lexical database
# brew "yamllint"                 # disabled — YAML linter
# brew "yarn"                     # not needed — JS package manager
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "olets/tap/zsh-abbr"
# brew "stripe/stripe-cli/stripe" # not needed — payment processing CLI
# brew "teamookla/speedtest/speedtest"  # disabled — speed test
brew "uv"

# homebrew-cask
# https://github.com/Homebrew/homebrew-cask

# cask "1password-cli"
# cask "alfred"                   # disabled
# cask "bartender"                # disabled
# cask "brave-browser"            # disabled
# cask "carbon-copy-cloner"       # disabled
# cask "cleanmymac"               # disabled
# cask "firefox"                  # disabled
cask "font-cascadia-code"
cask "font-cascadia-code-nf"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-envy-code-r"
cask "font-envy-code-r-nerd-font"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-drive"
# cask "grammarly-desktop"        # disabled
# cask "hazel"                    # disabled
cask "istat-menus"
cask "iterm2"
# cask "kitty"                    # not needed — using ghostty
# cask "loom"                     # not needed — screen recording
# cask "ngrok"                    # disabled
# cask "notion"                   # disabled
# cask "obsidian"                 # disabled
# cask "postico"                  # not needed — PostgreSQL GUI
# cask "qxmledit"                 # not needed — XML editor
# cask "screenflick"              # not needed — screen recording
# cask "signal"                   # disabled
# cask "tableplus"                # disabled
# cask "telegram"                 # disabled
# cask "todoist-app"              # disabled
# cask "viber"                    # disabled
# cask "whatsapp"                 # disabled
cask "tailscale"
cask "visual-studio-code"
cask "zoom"

# mas "1Password for Safari", id: 1569813296  # disabled
# mas "e-Sword X", id: 968437868              # disabled
# mas "Keynote", id: 409183694                # disabled
# mas "Logic Pro", id: 634148309              # disabled
# mas "Marked 2", id: 890031187              # disabled
# mas "Numbers", id: 409203825               # disabled
# mas "Pages", id: 409201541                 # disabled
# mas "The Unarchiver", id: 425424353        # disabled
# mas "Toggl Track", id: 1291898086          # disabled

# vim: set filetype=ruby:
