# https://github.com/Homebrew/homebrew-bundle

tap "olets/tap"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"

# Homebrew
# https://github.com/Homebrew/brew/

# brew "advancecomp"              # not needed — compression optimizer
brew "openssl@3"
brew "libyaml"
brew "readline"
brew "ansible"
# brew "asciidoctor"              # not needed — AsciiDoc converter
brew "asdf"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bats-core"
brew "btop"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "docutils"
brew "dos2unix"
brew "eza"
brew "fd"
# brew "ffmpegthumbnailer"        # not needed — video thumbnails
brew "gcc"
brew "fastfetch"
brew "fish"
# brew "flyctl"                   # not needed — Fly.io deployment CLI
# brew "fontforge"                # not needed — font editor
# brew "fonttools"                # not needed — font manipulation
brew "fzf"
brew "gh"
brew "ghostscript"
# brew "gifsicle"                 # not needed — GIF manipulation
brew "git"
brew "git-quick-stats"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "hadolint"
brew "pkgconf"
brew "highlight"
brew "htop"
brew "httpie"
# brew "hugo"                     # not needed — static site generator
brew "imagemagick"
# brew "jhead"                    # not needed — JPEG header editing
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "less"
brew "libpq"
brew "libtermkey"
# brew "lynx"                     # not needed — text web browser
brew "markdownlint-cli2"
brew "mas"
brew "media-info"
brew "memcached"
brew "most"
brew "neovim"
# brew "node"                     # not needed — managed by asdf
brew "onefetch"
brew "ossp-uuid"
brew "tmux"
# brew "overmind"                 # not needed — Procfile manager (Rails)
brew "pandoc"
brew "perl"
brew "pgcli"
# brew "php"                      # not needed — web scripting language
brew "pillow"
brew "pinentry-mac"
brew "poppler"
brew "postgresql@17", restart_service: :changed
# brew "prettier"                 # not needed — JS/web formatter
brew "pstree"
brew "redis"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "tealdeer"
brew "telnet"
brew "the_silver_searcher"
brew "trash"
brew "tree"
brew "unar"
brew "universal-ctags"
brew "urlview"
brew "vips"
# brew "w3m"                      # not needed — text web browser
brew "wget"
# brew "wordnet"                  # not needed — lexical database
brew "yamllint"
# brew "yarn"                     # not needed — JS package manager
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "olets/tap/zsh-abbr"
# brew "stripe/stripe-cli/stripe" # not needed — payment processing CLI
brew "teamookla/speedtest/speedtest"
brew "uv"

# homebrew-cask
# https://github.com/Homebrew/homebrew-cask

# cask "1password-cli"
# cask "alfred"                   # disabled
# cask "bartender"                # disabled
# cask "brave-browser"            # disabled
# cask "carbon-copy-cloner"       # disabled
# cask "cleanmymac"               # disabled
# cask "firefox"                  # disabled
cask "font-cascadia-code"
cask "font-cascadia-code-nf"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-envy-code-r"
cask "font-envy-code-r-nerd-font"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-drive"
# cask "grammarly-desktop"        # disabled
# cask "hazel"                    # disabled
cask "istat-menus"
cask "iterm2"
# cask "kitty"                    # not needed — using ghostty
# cask "loom"                     # not needed — screen recording
# cask "ngrok"                    # disabled
# cask "notion"                   # disabled
# cask "obsidian"                 # disabled
# cask "postico"                  # not needed — PostgreSQL GUI
# cask "qxmledit"                 # not needed — XML editor
# cask "screenflick"              # not needed — screen recording
# cask "signal"                   # disabled
# cask "tableplus"                # disabled
# cask "telegram"                 # disabled
# cask "todoist-app"              # disabled
# cask "viber"                    # disabled
# cask "whatsapp"                 # disabled
cask "tailscale"
cask "visual-studio-code"
cask "zoom"

# mas "1Password for Safari", id: 1569813296  # disabled
# mas "e-Sword X", id: 968437868              # disabled
# mas "Keynote", id: 409183694                # disabled
# mas "Logic Pro", id: 634148309              # disabled
# mas "Marked 2", id: 890031187              # disabled
# mas "Numbers", id: 409203825               # disabled
# mas "Pages", id: 409201541                 # disabled
# mas "The Unarchiver", id: 425424353        # disabled
# mas "Toggl Track", id: 1291898086          # disabled

# vim: set filetype=ruby:
