base-devel
bash
bash-completion
bat
btop
cmake
coreutils
curl
diff-so-fancy
eza
fd
fish
fzf
gcc
git
github-cli
gnupg
graphviz
htop
jq
lazydocker
lazygit
less
neovim
openssl
pkgconf
readline
ripgrep
rsync
rust
shellcheck
shfmt
starship
stow
tealdeer
the_silver_searcher
tmux
trash-cli
tree
ctags
wget
yq
zlib
zoxide
zsh
